In [17]:
url = "http://vps-40d69db1.vps.ovh.ca:21446/api/CotacaoIntradayAcaoResultadoValors/obtemPorRegraData?idRegra=1&diaNum=20211001"

In [2]:
import requests
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
from datetime import datetime

In [3]:
r = requests.get(url)
j = r.json()
df = pd.DataFrame.from_dict(j)

In [4]:
df.head()

  ticker  resultado  qtde
0  ABEV3         -1   187
1  ABEV3          0    67
2  ABEV3          1   270
3  AZUL4         -1   689
4  AZUL4          1    84

# Criar MÃ¡scara Booleana

In [6]:
dfMask = df['resultado']==-1

In [7]:
dfMask

0       True
1      False
2      False
3       True
4      False
       ...
169     True
170    False
171     True
172    False
173    False
Name: resultado, Length: 174, dtype: bool

In [8]:
len(df)

174

In [9]:
df.where(dfMask).head()

  ticker  resultado   qtde
0  ABEV3       -1.0  187.0
1    NaN        NaN    NaN
2    NaN        NaN    NaN
3  AZUL4       -1.0  689.0
4    NaN        NaN    NaN

In [12]:
df.where(dfMask).dropna().head()

   ticker  resultado   qtde
0   ABEV3       -1.0  187.0
3   AZUL4       -1.0  689.0
5   B3SA3       -1.0  196.0
7   BBAS3       -1.0   13.0
14  BEEF3       -1.0  294.0

## Forma mais comum

In [13]:
df[df['resultado']==-1].head()

   ticker  resultado  qtde
0   ABEV3         -1   187
3   AZUL4         -1   689
5   B3SA3         -1   196
7   BBAS3         -1    13
14  BEEF3         -1   294

In [16]:
df[(df['resultado']==1) | (df['resultado']==-1)].head()

  ticker  resultado  qtde
0  ABEV3         -1   187
2  ABEV3          1   270
3  AZUL4         -1   689
4  AZUL4          1    84
5  B3SA3         -1   196